import requests
from bs4 import BeautifulSoup


# 获取电影信息页面函数
def get_movies():
    headers = {
        'user-agent': 'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/52.0.2743.82 Safari/537.36',
        'Host': 'movie.douban.com'
    }
    # 观测到每页25个电影，抓取前250个电影需要10页
    for i in range(0, 10):
        link = 'https://movie.douban.com/top250?start=' + str(i * 25)
        r = requests.get(link, headers=headers, timeout=10)
        print(str(i + 1), "页响应状态码:", r.status_code)
        print(r.text)


# 可以成功抓取电影的每个页面信息
# get_movies()

# 提取所需的TOP250电影名称
def get_movies_name():
    headers = {
        'user-agent': 'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/52.0.2743.82 Safari/537.36',
        'Host': 'movie.douban.com'
    }
    movie_list = []
    for i in range(0, 10):
        link = 'https://movie.douban.com/top250?start=' + str(i * 25)
        r = requests.get(link, headers=headers, timeout=10)
        print(str(i + 1), "页响应状态码:", r.status_code)
        '''
            1 页响应状态码: 200
            2 页响应状态码: 200
            3 页响应状态码: 200
            4 页响应状态码: 200
            5 页响应状态码: 200
            6 页响应状态码: 200
            7 页响应状态码: 200
            8 页响应状态码: 200
            9 页响应状态码: 200
            10 页响应状态码: 200
        '''

        # 在获取HTML页面信息的前提下，用BS进行目标信息抓取
        soup = BeautifulSoup(r.text, "lxml")
        div_list = soup.find_all('div', class_='hd')
        for each in div_list:
            movie = each.a.span.text.strip()
            movie_list.append(movie)
    return movie_list


movie_list = get_movies_name()
print(movie_list)
'''
['肖申克的救赎', '霸王别姬', '这个杀手不太冷', '阿甘正传', '美丽人生', '泰坦尼克号', '千与千寻', '辛德勒的名单', '盗梦空间', '机器人总动员', '忠犬八公的故事', '三傻大闹宝莱坞', '海上钢琴师', '放牛班的春天', '大话西游之大圣娶亲', '楚门的世界', '龙猫', '星际穿越', '教父', '熔炉', '无间道', '当幸福来敲门', '触不可及', '怦然心动', '疯狂动物城', '乱世佳人', '蝙蝠侠：黑暗骑士', '活着', '天堂电影院', '少年派的奇幻漂流', '十二怒汉', '鬼子来了', '指环王3：王者无敌', '控方证人', '天空之城', '搏击俱乐部', '飞屋环游记', '大话西游之月光宝盒', '罗马假日', '摔跤吧！爸爸', '窃听风暴', '哈尔的移动城堡', '辩护人', '闻香识女人', '两杆大烟枪', '飞越疯人院', '死亡诗社', 'V字仇杀队', '指环王2：双塔奇兵', '海豚湾', '教父2', '指环王1：魔戒再现', '饮食男女', '美丽心灵', '素媛', '情书', '狮子王', '末代皇帝', '钢琴家', '美国往事', '小鞋子', '七宗罪', '本杰明·巴顿奇事', '被嫌弃的松子的一生', '致命魔术', '西西里的美丽传说', '黑客帝国', '让子弹飞', '看不见的客人', '拯救大兵瑞恩', '天使爱美丽', '音乐之声', '低俗小说', '大闹天宫', '勇敢的心', '剪刀手爱德华', '哈利·波特与魔法石', '沉默的羔羊', '蝴蝶效应', '春光乍泄', '心灵捕手', '入殓师', '猫鼠游戏', '布达佩斯大饭店', '禁闭岛', '玛丽和马克思', '阳光灿烂的日子', '幽灵公主', '第六感', '狩猎', '重庆森林', '穿条纹睡衣的男孩', '致命ID', '断背山', '加勒比海盗', '阿凡达', '摩登时代', '大鱼', '告白', '寻梦环游记', '一一', '射雕英雄传之东成西就', '甜蜜蜜', '阳光姐妹淘', '消失的爱人', '爱在黎明破晓前', '上帝之城', '喜剧之王', '小森林 夏秋篇', '侧耳倾听', '风之谷', '恐怖直播', '倩女幽魂', '超脱', '红辣椒', '爱在日落黄昏时', '菊次郎的夏天', '驯龙高手', '幸福终点站', '神偷奶爸', '借东西的小人阿莉埃蒂', '杀人回忆', '请以你的名字呼唤我', '哈利·波特与死亡圣器(下)', '七武士', '岁月神偷', '小森林 冬春篇', '怪兽电力公司', '萤火虫之墓', '谍影重重3', '电锯惊魂', '7号房的礼物', '东邪西毒', '喜宴', '疯狂原始人', '贫民窟的百万富翁', '萤火之森', '记忆碎片', '黑天鹅', '真爱至上', '超能陆战队', '英雄本色', '唐伯虎点秋香', '蝙蝠侠：黑暗骑士崛起', '雨人', '心迷宫', '卢旺达饭店', '傲慢与偏见', '荒蛮故事', '海洋', '纵横四海', '无人知晓', '时空恋旅人', '海边的曼彻斯特', '教父3', '玩具总动员3', '完美的世界', '花样年华', '虎口脱险', '血战钢锯岭', '达拉斯买家俱乐部', '恋恋笔记本', '燃情岁月', '二十二', '雨中曲', '冰川时代', '魂断蓝桥', '我是山姆', '穿越时空的少女', '猜火车', '人工智能', '头脑特工队', '被解救的姜戈', '爆裂鼓手', '未麻的部屋', '你的名字。', '无敌破坏王', '罗生门', '浪潮', '阿飞正传', '香水', '朗读者', '房间', '模仿游戏', '恐怖游轮', '一个叫欧维的男人决定去死', '可可西里', '忠犬八公物语', '魔女宅急便', '战争之王', '一次别离', '哪吒闹海', '完美陌生人', '谍影重重', '追随', '谍影重重2', '地球上的星星', '牯岭街少年杀人事件', '撞车', '黑客帝国3：矩阵革命', '惊魂记', '青蛇', '梦之安魂曲', '海街日记', '小萝莉的猴神大叔', '再次出发之纽约遇见你', '新龙门客栈', '步履不停', '源代码', '终结者2：审判日', '东京物语', '初恋这件小事', '疯狂的石头', '城市之光', '绿里奇迹', '爱在午夜降临前', '无耻混蛋', '末路狂花', '这个男人来自地球', '秒速5厘米', '勇闯夺命岛', 'E.T. 外星人', '变脸', '彗星来的那一夜', '碧海蓝天', '卡萨布兰卡', '黄金三镖客', '发条橙', '聚焦', '血钻', '美国丽人', '国王的演讲', '海盗电台', '非常嫌疑犯', '荒野生存', '黑鹰坠落', '我爱你', '千钧一发', '英国病人', '天书奇谭', '遗愿清单', '2001太空漫游', '荒岛余生', '迁徙的鸟', '勇士', '枪火', '海蒂和爷爷', '叫我第一名', '燕尾蝶', '穆赫兰道']
'''
