import requests
import threading


def display_info(code):
    url = 'http://hq.sinajs.cn/list=' + code
    response = requests.get(url).text
    print(response)


def single_thread(codes):
    for code in codes:
        code = code.strip()
        display_info(code)


def multi_thread(tasks):
    # 用列表推导生成线程，注意codes后面的,号
    threads = [threading.Thread(target=single_thread, args=(codes,)) for codes in tasks]
    # 启动线程
    for t in threads:
        t.start()
    # 等待线程结束
    for t in threads:
        t.join()


# 注意main函数的形式
if __name__ == '__main__':
    codes = ['sh600001', 'sh600002', 'sh600003', 'sh600004', 'sh600005', 'sh600006']

    # 计算每个线程要做多少工作
    thread_len = int(len(codes) / 4)
    print(thread_len)  # 1

    # 分配线程任务
    t1 = codes[0: thread_len]
    t2 = codes[thread_len: thread_len * 2]
    t3 = codes[thread_len * 2: thread_len * 3]
    t4 = codes[thread_len * 3:]

    # 多线程启动
    multi_thread([t1, t2, t3, t4])

    '''
        var hq_str_sh600002="齐鲁石化,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0,0.000,0,0.000,0,0.000,0,0.000,0,0.000,0,0.000,0,0.000,0,0.000,0,0.000,0,0.000,0,0.000,2018-08-03,11:31:35,-3";
    
    var hq_str_sh600001="邯郸钢铁,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0,0.000,0,0.000,0,0.000,0,0.000,0,0.000,0,0.000,0,0.000,0,0.000,0,0.000,0,0.000,0,0.000,2018-08-03,11:31:35,-3";
    
    var hq_str_sh600003="ST东北高,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0,0.000,0,0.000,0,0.000,0,0.000,0,0.000,0,0.000,0,0.000,0,0.000,0,0.000,0,0.000,0,0.000,2018-08-03,11:31:35,-3";
    
    var hq_str_sh600004="白云机场,13.090,13.140,13.010,13.190,12.800,13.000,13.060,5686726,74149713.000,108070,13.000,77200,12.990,5100,12.980,18400,12.970,7300,12.960,1300,13.060,31900,13.070,3600,13.080,2200,13.100,1700,13.110,2018-08-16,15:00:00,00";
    
    var hq_str_sh600005="武钢股份,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0,0.000,0,0.000,0,0.000,0,0.000,0,0.000,0,0.000,0,0.000,0,0.000,0,0.000,0,0.000,0,0.000,2018-08-16,09:14:30,00";
    
    var hq_str_sh600006="东风汽车,3.800,3.840,3.820,3.840,3.760,3.800,3.810,4234017,16123269.000,269400,3.800,88500,3.790,182600,3.780,218200,3.770,314500,3.760,700,3.810,42445,3.820,37200,3.830,73010,3.840,85900,3.850,2018-08-16,15:00:00,00";
    '''
